[AdventTitanM1 X2CharacterTemplate]
strCharacterName="ADVENT Titan"
strAcquiredText="Slow and steady, this heavy melee unit aims to get in range to plunge its twin axes into some poor sap." 
[AdventTitanM2 X2CharacterTemplate]
strCharacterName="Advanced Titan"
strAcquiredText="Slow and steady, this heavy melee unit aims to get in range to plunge its twin axes into some poor sap." 
[AdventTitanM3 X2CharacterTemplate]
strCharacterName="Elite Titan"
strAcquiredText="Slow and steady, this heavy melee unit aims to get in range to plunge its twin axes into some poor sap." 